	
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
<<<<<<< Updated upstream
		МодульБота.Получить();
		


=======
		// Вставить содержимое обработчика.   
		// СистемаВзаимодействия.ПодключитьОбработчикНовыхСообщенийАсинх(МоделькаОповещения);
		Элементы.Сообщение.Заголовок = ОбщийМодуль2.Получить();
>>>>>>> Stashed changes
		КонецПроцедуры

&НаКлиенте
		Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
			// Вставить содержимое обработчика.
		КонецПроцедуры

&НаКлиенте
		Процедура ПриОткрытии(Отказ)
			// МоделькаОповещения = Новый ОписаниеОповещения("ОбработкаПолучения", ЭтотОбъект); 
			// СистемаВзаимодействия.ПодключитьОбработчикНовыхСообщенийАсинх(Идентификатор);
		КонецПроцедуры      
		

&НаКлиенте
Процедура ОбработкаПолучения(Сообщение) Экспорт
	
КонецПРоцедуры


&НаКлиенте
Процедура Обновить(Команда)
	МодульБота.Получить();
	Сообщить("Обновлено успешно");
КонецПроцедуры

