&НаКлиенте
Перем Идентификатор Экспорт;	
	
	
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		// Вставить содержимое обработчика.   
		// СистемаВзаимодействия.ПодключитьОбработчикНовыхСообщенийАсинх(МоделькаОповещения);
		Элементы.Сообщение.Заголовок = МодульБота.Получить();
		КонецПроцедуры

&НаКлиенте
		Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
			// Вставить содержимое обработчика.
		КонецПроцедуры

&НаКлиенте
		Процедура ПриОткрытии(Отказ)
			// МоделькаОповещения = Новый ОписаниеОповещения("ОбработкаПолучения", ЭтотОбъект); 
			// СистемаВзаимодействия.ПодключитьОбработчикНовыхСообщенийАсинх(Идентификатор);
		КонецПроцедуры      
		

&НаКлиенте
Процедура ОбработкаПолучения(Сообщение) Экспорт
	
КонецПРоцедуры


&НаКлиенте
Процедура Обновить(Команда)
	Элементы.Сообщение.Заголовок = МодульБота.Получить();
	Сообщить("Обновлено успешно");
КонецПроцедуры

